In [3]:
import pandas as pd
import numpy as np

## pandas数据结构

### 1. Series——一维数据结构

### 1.1 Series的创建

In [4]:
# 默认索引
pd.Series(np.arange(10)) # 默认起点0，步长为1 输出：[0 1 2...9]

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [5]:
# 指定索引
pd.Series([6.7,5.6,3,10,2], index=[1,2,3,4,5])

1     6.7
2     5.6
3     3.0
4    10.0
5     2.0
dtype: float64

In [12]:
# 通过字典数据创建
color_count = pd.Series({'red':100,'blue':20,'green':30})
color_count

red      100
blue      20
green     30
dtype: int64

### 1.2 Series的属性

In [13]:
# index
color_count.index

Index(['red', 'blue', 'green'], dtype='object')

In [14]:
# values
color_count.values

array([100,  20,  30], dtype=int64)

In [15]:
# 通过索引获取某数据
color_count[2]

30

### 2. DataFrame——二维数据结构

### 2.1 DataFrame的创建

In [16]:
pd.DataFrame(np.random.randn(2,3))

          0         1         2
0 -0.479159 -1.029544 -2.149745
1 -0.643298 -0.358206  1.065046

In [21]:
score = np.random.randint(40, 100, (10, 5))

In [22]:
score_df = pd.DataFrame(score)

In [23]:
score_df

    0   1   2   3   4
0  53  88  99  63  64
1  81  40  88  83  78
2  83  52  60  51  43
3  48  56  74  48  41
4  59  58  86  46  93
5  86  64  48  96  97
6  44  61  79  46  69
7  61  66  78  84  99
8  62  55  71  56  48
9  84  95  81  51  72

In [30]:
# 增加索引
subjects = ["语文", "数学", "英语", "政治", "体育"]
stu = ['同学' + str(i) for i in range(score_df.shape[0])]
data = pd.DataFrame(score, columns=subjects, index=stu)

In [28]:
data

     语文  数学  英语  政治  体育
同学0  53  88  99  63  64
同学1  81  40  88  83  78
同学2  83  52  60  51  43
同学3  48  56  74  48  41
同学4  59  58  86  46  93
同学5  86  64  48  96  97
同学6  44  61  79  46  69
同学7  61  66  78  84  99
同学8  62  55  71  56  48
同学9  84  95  81  51  72

### 2.2 DataFrame的属性

In [31]:
# shape
data.shape

(10, 5)

In [32]:
# index
data.index

Index(['同学0', '同学1', '同学2', '同学3', '同学4', '同学5', '同学6', '同学7', '同学8', '同学9'], dtype='object')

In [33]:
# columns
data.columns

Index(['语文', '数学', '英语', '政治', '体育'], dtype='object')

In [34]:
# values
data.values

array([[53, 88, 99, 63, 64],
       [81, 40, 88, 83, 78],
       [83, 52, 60, 51, 43],
       [48, 56, 74, 48, 41],
       [59, 58, 86, 46, 93],
       [86, 64, 48, 96, 97],
       [44, 61, 79, 46, 69],
       [61, 66, 78, 84, 99],
       [62, 55, 71, 56, 48],
       [84, 95, 81, 51, 72]])

In [35]:
# 转置T
data.T

    同学0  同学1  同学2  同学3  同学4  同学5  同学6  同学7  同学8  同学9
语文   53   81   83   48   59   86   44   61   62   84
数学   88   40   52   56   58   64   61   66   55   95
英语   99   88   60   74   86   48   79   78   71   81
政治   63   83   51   48   46   96   46   84   56   51
体育   64   78   43   41   93   97   69   99   48   72

In [36]:
# 显示前5行数据查看
data.head()

     语文  数学  英语  政治  体育
同学0  53  88  99  63  64
同学1  81  40  88  83  78
同学2  83  52  60  51  43
同学3  48  56  74  48  41
同学4  59  58  86  46  93

In [37]:
# 显示后5行数据查看
data.tail()

     语文  数学  英语  政治  体育
同学5  86  64  48  96  97
同学6  44  61  79  46  69
同学7  61  66  78  84  99
同学8  62  55  71  56  48
同学9  84  95  81  51  72

### 2.3 DataFrame索引的设置

#### 2.3.1  修改行列索引

In [39]:
stu = ["学生_" + str(i) for i in range(score_df.shape[0])]
data.index = stu

In [40]:
data

      语文  数学  英语  政治  体育
学生_0  53  88  99  63  64
学生_1  81  40  88  83  78
学生_2  83  52  60  51  43
学生_3  48  56  74  48  41
学生_4  59  58  86  46  93
学生_5  86  64  48  96  97
学生_6  44  61  79  46  69
学生_7  61  66  78  84  99
学生_8  62  55  71  56  48
学生_9  84  95  81  51  72

#### 2.3.2  重设索引

In [43]:
# drop = False 不删除原来的索引
data.reset_index(drop = False)

  index  语文  数学  英语  政治  体育
0  学生_0  53  88  99  63  64
1  学生_1  81  40  88  83  78
2  学生_2  83  52  60  51  43
3  学生_3  48  56  74  48  41
4  学生_4  59  58  86  46  93
5  学生_5  86  64  48  96  97
6  学生_6  44  61  79  46  69
7  学生_7  61  66  78  84  99
8  学生_8  62  55  71  56  48
9  学生_9  84  95  81  51  72

In [44]:
# drop = True 删除原来的索引
data.reset_index(drop =True)

   语文  数学  英语  政治  体育
0  53  88  99  63  64
1  81  40  88  83  78
2  83  52  60  51  43
3  48  56  74  48  41
4  59  58  86  46  93
5  86  64  48  96  97
6  44  61  79  46  69
7  61  66  78  84  99
8  62  55  71  56  48
9  84  95  81  51  72

#### 2.3.3  以某列值设置为新的索引

In [56]:
# 创建
df = pd.DataFrame({'month': [1, 4, 7, 10],
                    'year': [2012, 2014, 2013, 2014],
                    'sale':[55, 40, 84, 31]})

In [57]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [58]:
# 以月份设置新的索引
df.set_index('month')

       year  sale
month
1      2012    55
4      2014    40
7      2013    84
10     2014    31

In [59]:
# 设置多个索引，以年和月份
df = df.set_index(['year', 'month'])

In [60]:
df

            sale
year month
2012 1        55
2014 4        40
2013 7        84
2014 10       31

### 3. MultiIndex——三维数据结构